In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
  {
    "Gender": ['Male','Male','Female','Female','Female'], 
    "Team"  : [1,2,3,3,1]
  })
print(df)

   Gender  Team
0    Male     1
1    Male     2
2  Female     3
3  Female     3
4  Female     1

In [3]:
schools = np.array(["Cambridge","Oxford","Oxford","Cambridge","Oxford"])

In [6]:
#adding columns
df['School'] = schools
df

   Gender  Team     School
0    Male     1  Cambridge
1    Male     2     Oxford
2  Female     3     Oxford
3  Female     3  Cambridge
4  Female     1     Oxford

In [8]:
#append a row
df.append( {"Gender": "Male", 
            "Team": 2,
           "School" : "NUS"}, ignore_index=True)

   Gender  Team     School
0    Male     1  Cambridge
1    Male     2     Oxford
2  Female     3     Oxford
3  Female     3  Cambridge
4  Female     1     Oxford
5    Male     2        NUS

In [16]:
data = {'name': ['Janet', 'Nad', 'Timothy', 'June', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [6, 13, 14, 1, 7]}
df = pd.DataFrame(data, index = 
       ['Singapore', 'China', 'Japan', 'Sweden', 'Norway'])
print(df)

              name  year  reports
Singapore    Janet  2012        6
China          Nad  2012       13
Japan      Timothy  2013       14
Sweden        June  2014        1
Norway         Amy  2014        7

In [17]:
#inplace = True modify the origional result but no result returned 
df.drop(index=['Japan','Sweden'])

            name  year  reports
Singapore  Janet  2012        6
China        Nad  2012       13
Norway       Amy  2014        7

In [15]:
df

            name  year  reports
Singapore  Janet  2012        6
China        Nad  2012       13
Norway       Amy  2014        7

In [21]:
df.drop(df.index[2:4])

            name  year  reports
Singapore  Janet  2012        6
China        Nad  2012       13
Norway       Amy  2014        7

In [23]:
df.drop(df.index[[2,4]])

            name  year  reports
Singapore  Janet  2012        6
China        Nad  2012       13
Sweden      June  2014        1

In [24]:
#drop columns
df.drop(columns='reports')
#approach 2
#drop columns
df.drop('reports', axis=1)

              name  year
Singapore    Janet  2012
China          Nad  2012
Japan      Timothy  2013
Sweden        June  2014
Norway         Amy  2014

In [26]:
#retrieve rows based on names
df[df.name != 'Nad']

              name  year  reports
Singapore    Janet  2012        6
Japan      Timothy  2013       14
Sweden        June  2014        1
Norway         Amy  2014        7

In [28]:
#code to find janet
df[df.name == 'Janet']

            name  year  reports
Singapore  Janet  2012        6

In [30]:
#find all the rows have year 2030
df[df.year > 2013]

        name  year  reports
Sweden  June  2014        1
Norway   Amy  2014        7

In [39]:
#all rows year > 2013 or name = jannet
df[(df.year > 2013) | (df.name == 'Janet') ]

            name  year  reports
Singapore  Janet  2012        6
Sweden      June  2014        1
Norway       Amy  2014        7

In [41]:
df[(df.year > 2013) & (df.name == 'Janet') ]

Empty DataFrame
Columns: [name, year, reports]
Index: []

In [48]:
#name contains word contain 'un'
df[(df.year > 2013) & (df.name.str.contains("un")) ]

        name  year  reports
Sweden  June  2014        1

In [52]:
df[(df.name.str.contains("un|my"))]

        name  year  reports
Sweden  June  2014        1
Norway   Amy  2014        7

In [57]:
df[df.name.isin(['Timothy','June'])]

           name  year  reports
Japan   Timothy  2013       14
Sweden     June  2014        1


#
#https://towardsdatascience.com/understanding-args-and-kwargs-in-python-321937f49c5b
#https://levelup.gitconnected.com/understanding-groupby-function-in-pandas-dataframe-part-1-23cc762b3174
#la fun:https://levelup.gitconnected.com/the-gems-of-python-7-features-you-should-know-and-you-better-know-it-well-cffa4141d7fa

In [59]:
#next course
#python code to talk to mysql database